Autodesk.Revit.DB.BuiltInFailures.RebarBendingDetailFailures.RemoveBendingDetailWithInvalidRebarElement
The reinforcement element is no longer supporting bending details. The associated bending detail elements have been deleted.

Autodesk.Revit.DB.BuiltInFailures.RebarBendingDetailFailures
Failures concerning rebar bending details.